/* $ObjectName=MAFSettingScreen_iOS */
/* $Collection=frwk.uicontrols.ios */
/* $Domain=BC */
/* $Developer=I043975 */
/* $Description=Mobile Application Framework - iOS Reusable UI Components */

/* XTIT: title in navigation bar */
"SETTINGS_TITLE" = "Asetukset";

/* XGRP: header for a section */
"GENERAL_SETTINGS" = "Yleiset asetukset";

/* XTIT: title in navigation bar for a view containing logon related fields */
"LOGON_SETTINGS" = "Kirjautumisasetukset";

/* XTIT: title in navigation bar for a view containing version information */
"VERSION" = "Versio";

/* XTIT: title in navigation bar for 'about' view */
"ABOUT" = "Tietoja";

/* XTIT: title in navigation bar for a view containing logon type setting */
"LOGON_TYPE" = "Kirjautumistyyppi";

/* XLST: logon type to choose */
"BASIC_AUTH" = "Vakiotodentaminen";

/* XLST: logon type to choose */
"SSO" = "SSO";

/* XLST: logon type to choose */
"DEMO" = "Demo";

"SERV_URL" = "Service URL";

/* XFLD: label for a field */
"USERNAME" = "Käyttäjänimi";

/* XFLD: label for a field */
"PASSWORD" = "Salasana";

"SETTINGS" = "Settings";

/* XTIT: title in navigation bar for a view containing advanced settings */
"ADVANCED_SETTINGS" = "Laajennetut asetukset";

/* XFLD: label for a field */
"SERVER_URL" = "Palvelimen URL";

/* XFLD: label for a switch (on/off), max. approx. 18 characters */
"USE_SUP" = "Käytä SUP:tä";

/* XTIT: title in navigation bar for a view containing SUP connection information */
"SUP_CONNECTION_INFO" = "SUP-yhteystiedot";

/* XFLD: label for a field */
"SERVER_NAME" = "Palvelimen nimi";

/* XFLD: label for a field */
"SERVER_PORT" = "Palvelimen portti";

/* XFLD: label for a field */
"COMPANY_ID" = "Yritystunnus";

/* XFLD: label for a field */
"ACTIVATION_CODE" = "Aktivointikoodi";

/* XFLD: label for a field */
"URL_PREFIX" = "URL-etuliite";

/* XGRP: header for a section */
"APPLICATION_SPECIFIC_SETTINGS" = "Sovelluskohtaiset asetukset";

/* XMSG: error message title, displayed in an alert view */
"Msg_Title_Datavault_Error" = "Virhe tietojen tallennuksessa";

/* XMSG: error message details, displayed in an alert view, should not be longer than 2-3 rows */
"Msg_Datavault_Error" = "Pysyvä tallennus suojattuun muistiin epäonnistui.";

/* XTIT: title trait in navigation bar */
"HEADING" = "Otsikko";

